---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.MoveNext
source: html/e9797ab6-e860-b4dc-65e3-785ff16996b5.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.